{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "A": 0,
      "B": 1,
      "C": 2,
      "G": 3,
      "K": 4,
      "M": 5,
      "N": 6,
      "R": 7,
      "S": 8,
      "T": 9,
      "V": 10,
      "W": 11,
      "Y": 12,
      "AA": 13,
      "TT": 14,
      "TG": 15,
      "CA": 16,
      "CC": 17,
      "GG": 18,
      "TA": 19,
      "TC": 20,
      "GA": 21,
      "GC": 22,
      "AAA": 23,
      "TCA": 24,
      "TGA": 25,
      "TAA": 26,
      "TTA": 27,
      "GAA": 28,
      "TCC": 29,
      "TTC": 30,
      "GTG": 31,
      "CAC": 32,
      "GTT": 33,
      "TGC": 34,
      "GGA": 35,
      "GCA": 36,
      "GCC": 37,
      "TAC": 38,
      "CAA": 39,
      "TTTT": 40,
      "GTA": 41,
      "GGC": 42,
      "GTC": 43,
      "TGAA": 44,
      "TAAA": 45,
      "GAC": 46,
      "CCC": 47,
      "TGTT": 48,
      "TCAA": 49,
      "TCTT": 50,
      "CATT": 51,
      "GAAA": 52,
      "TGGA": 53,
      "CAGG": 54,
      "AAC": 55,
      "CAGA": 56,
      "TGGG": 57,
      "TATT": 58,
      "TGTG": 59,
      "CAGC": 60,
      "AAAA": 61,
      "CACA": 62,
      "TCTG": 63,
      "CTT": 64,
      "GTAA": 65,
      "TCCA": 66,
      "GTGA": 67,
      "TATA": 68,
      "CCAA": 69,
      "GTCA": 70,
      "GCAA": 71,
      "CCTT": 72,
      "GGAA": 73,
      "CATG": 74,
      "GCTT": 75,
      "TAGA": 76,
      "GCTG": 77,
      "TCCC": 78,
      "GTTA": 79,
      "CACC": 80,
      "TATG": 81,
      "GCAC": 82,
      "TTCTT": 83,
      "TCAC": 84,
      "GAGA": 85,
      "TCTC": 86,
      "GATT": 87,
      "TTAC": 88,
      "CATA": 89,
      "GGTT": 90,
      "GTCC": 91,
      "TGAC": 92,
      "GTTC": 93,
      "TGCC": 94,
      "AAAC": 95,
      "TCTA": 96,
      "GTGC": 97,
      "GAGG": 98,
      "TGTA": 99,
      "TGGC": 100,
      "TGCA": 101,
      "GTAC": 102,
      "GAAC": 103,
      "TTAA": 104,
      "GCCC": 105,
      "GGCC": 106,
      "TAAC": 107,
      "TACA": 108,
      "GAAAA": 109,
      "TAAAA": 110,
      "TTGG": 111,
      "TTCAA": 112,
      "GGGG": 113,
      "GCCA": 114,
      "TCAAA": 115,
      "GGAC": 116,
      "TTTG": 117,
      "TAGG": 118,
      "GATG": 119,
      "CACAA": 120,
      "TACC": 121,
      "CAGAA": 122,
      "TTCC": 123,
      "CAGCA": 124,
      "TTGA": 125,
      "TGCAA": 126,
      "TACAA": 127,
      "TGGTG": 128,
      "TCCAA": 129,
      "CATC": 130,
      "GGGA": 131,
      "TTTA": 132,
      "CATCA": 133,
      "CAGTG": 134,
      "TGTC": 135,
      "TTATT": 136,
      "TGGTT": 137,
      "TGGAA": 138,
      "CAGGA": 139,
      "CAGTT": 140,
      "TGATT": 141,
      "TGCTT": 142,
      "CACTT": 143,
      "TGAAA": 144,
      "TAATT": 145,
      "GTAAA": 146,
      "TCATT": 147,
      "TCTTC": 148,
      "GACC": 149,
      "TCTGA": 150,
      "CAAC": 151,
      "TCCTT": 152,
      "TAGC": 153,
      "GGGC": 154,
      "GGTG": 155,
      "CCCC": 156,
      "GAGC": 157,
      "CAGCC": 158,
      "TCTCA": 159,
      "CATAA": 160,
      "CATTA": 161,
      "TGCTG": 162,
      "AAATT": 163,
      "CAAAA": 164,
      "CATGA": 165,
      "TCTCC": 166,
      "GAAGA": 167,
      "GTGAA": 168,
      "CCTG": 169,
      "GTTTT": 170,
      "GCCAA": 171,
      "GATA": 172,
      "GCAAA": 173,
      "TTCTG": 174,
      "TACTT": 175,
      "TAGAA": 176,
      "GCATT": 177,
      "TCTGC": 178,
      "GTCAA": 179,
      "TGTAA": 180,
      "TATAA": 181,
      "TGAGG": 182,
      "TATTA": 183,
      "TCGG": 184,
      "GTGTT": 185,
      "TGGGA": 186,
      "TAGTT": 187,
      "TATCA": 188,
      "CATCC": 189,
      "GTATT": 190,
      "TCTAA": 191,
      "GAGAA": 192,
      "TCCAC": 193,
      "TCTTA": 194,
      "TCAGG": 195,
      "TGGCA": 196,
      "GAAAC": 197,
      "TGAAC": 198,
      "GCTGA": 199,
      "CAGTA": 200,
      "TGAAAA": 201,
      "TATGA": 202,
      "GTCTT": 203,
      "TGTTA": 204,
      "TGTCA": 205,
      "GCAGG": 206,
      "GATGA": 207,
      "TCAAAA": 208,
      "CAGGC": 209,
      "TAAAC": 210,
      "TCAAC": 211,
      "GAGGA": 212,
      "GTTAA": 213,
      "TAGTG": 214,
      "GAATT": 215,
      "CACAC": 216,
      "GACAA": 217,
      "CATTC": 218,
      "TCTTTT": 219,
      "TGTGA": 220,
      "TCACC": 221,
      "GAAGG": 222,
      "GCGG": 223,
      "GCTA": 224,
      "TGGCC": 225,
      "GGCTT": 226,
      "GCTC": 227,
      "GGAGG": 228,
      "GCTGC": 229,
      "CCAAA": 230,
      "GGAAA": 231,
      "TGGTA": 232,
      "GACTT": 233,
      "CATTTT": 234,
      "TCCCC": 235,
      "CATGC": 236,
      "CCCTT": 237,
      "TCAGA": 238,
      "GGAGA": 239,
      "GCCTT": 240,
      "TATC": 241,
      "TAGCA": 242,
      "GT": 243,
      "TGTCC": 244,
      "AACTT": 245,
      "GCTCA": 246,
      "GAGTG": 247,
      "CAGTC": 248,
      "GCCCC": 249,
      "TAAAAA": 250,
      "TTTTAA": 251,
      "TAGTA": 252,
      "GCCAC": 253,
      "CACCC": 254,
      "CAGAC": 255,
      "AAAGA": 256,
      "GTTGG": 257,
      "TCTAC": 258,
      "TATTC": 259,
      "TGAGA": 260,
      "CAGGAA": 261,
      "TAAGG": 262,
      "GTCAC": 263,
      "GGATT": 264,
      "GCTTC": 265,
      "GCTCC": 266,
      "GCAGA": 267,
      "GTGGG": 268,
      "TGACC": 269,
      "TGTTAA": 270,
      "CAATT": 271,
      "GTCCC": 272,
      "TAAGA": 273,
      "CAGCAA": 274,
      "TGGGAA": 275,
      "GTGAC": 276,
      "CACTG": 277,
      "TCGA": 278,
      "TTACC": 279,
      "AAAGG": 280,
      "CAGAAA": 281,
      "TGTTTT": 282,
      "GCACC": 283,
      "GTGGA": 284,
      "TGGGC": 285,
      "TATTTT": 286,
      "TAGGA": 287,
      "TGTTC": 288,
      "TGTGC": 289,
      "GTTGA": 290,
      "TGGAC": 291,
      "CATAC": 292,
      "GAAGAA": 293,
      "TGCCC": 294,
      "GCAGC": 295,
      "TACAC": 296,
      "TGCTGC": 297,
      "GGCAA": 298,
      "CATCTT": 299,
      "AAAGAA": 300,
      "GTAAC": 301,
      "GTTAC": 302,
      "CATTAA": 303,
      "GTTCTT": 304,
      "GCTAA": 305,
      "AC": 306,
      "AAACC": 307,
      "GTGCC": 308,
      "TATTAA": 309,
      "TGCAC": 310,
      "TTAGA": 311,
      "GTTCC": 312,
      "GGACC": 313,
      "TCTGGA": 314,
      "TGAAGA": 315,
      "TGAATT": 316,
      "TGTAC": 317,
      "TCATCA": 318,
      "GCGC": 319,
      "TTAGG": 320,
      "TATCC": 321,
      "TGATGA": 322,
      "TCCAGA": 323,
      "GTAGA": 324,
      "TGGTC": 325,
      "TAAATT": 326,
      "TTTTTT": 327,
      "CACAAA": 328,
      "TATGC": 329,
      "CATGTT": 330,
      "TCCATT": 331,
      "CATCAA": 332,
      "TCTCTT": 333,
      "CACCAA": 334,
      "TTATTA": 335,
      "GTAAAA": 336,
      "TATAC": 337,
      "GCGA": 338,
      "GCAGCA": 339,
      "TAATAA": 340,
      "TTCAAA": 341,
      "TGATG": 342,
      "GAAATT": 343,
      "GAACC": 344,
      "TCCAGG": 345,
      "GATAA": 346,
      "TCAGC": 347,
      "GTGGTG": 348,
      "TCTGTT": 349,
      "TTACAA": 350,
      "TCACTT": 351,
      "GGTA": 352,
      "CAGTGA": 353,
      "CAGCAC": 354,
      "TCTGGG": 355,
      "TACAAA": 356,
      "CACAGA": 357,
      "CAGCTT": 358,
      "TTCTTC": 359,
      "TGAGAA": 360,
      "TCAGAA": 361,
      "GCAAC": 362,
      "AAAAAA": 363,
      "TGAGGA": 364,
      "GGGAA": 365,
      "TCCCAA": 366,
      "CATGGA": 367,
      "GGTCA": 368,
      "TCTGAA": 369,
      "GCTTA": 370,
      "TGGAAA": 371,
      "TCCTCC": 372,
      "GTTCAA": 373,
      "TAACAA": 374,
      "CACCAC": 375,
      "CACATT": 376,
      "GAGGC": 377,
      "GAGCA": 378,
      "CCCAA": 379,
      "TGCTGA": 380,
      "TCGC": 381,
      "TCACAA": 382,
      "TCTTAA": 383,
      "GGTGA": 384,
      "GAGTT": 385,
      "GGGTG": 386,
      "GGGTT": 387,
      "TCCAAA": 388,
      "GCAAAA": 389,
      "TCCTG": 390,
      "CATCTG": 391,
      "TCCCTT": 392,
      "TAACC": 393,
      "AAACAA": 394,
      "TAGAC": 395,
      "TGACTT": 396,
      "TGACAA": 397,
      "TCAATT": 398,
      "TCTCCA": 399,
      "CCTCA": 400,
      "TAGCC": 401,
      "GGAGGA": 402,
      "TATAAA": 403,
      "TAAGAA": 404,
      "TTTTGG": 405,
      "TAATG": 406,
      "GATCA": 407,
      "GAGCC": 408,
      "CAGGTT": 409,
      "GTGGC": 410,
      "CAGATT": 411,
      "TTATG": 412,
      "TTAGAA": 413,
      "CCTTC": 414,
      "GGGGC": 415,
      "TAGTC": 416,
      "TACCC": 417,
      "TCTGTG": 418,
      "CATGAA": 419,
      "GTTGTT": 420,
      "TCTAAA": 421,
      "CCTGA": 422,
      "TCAGGA": 423,
      "GGCCC": 424,
      "TAGATT": 425,
      "CCTCC": 426,
      "CACCTT": 427,
      "TGGGTT": 428,
      "TCCAGC": 429,
      "TCTCAA": 430,
      "TAACTT": 431,
      "AACAAA": 432,
      "TCAGTT": 433,
      "TTTTGA": 434,
      "TCAGTG": 435,
      "GGGGA": 436,
      "GAAAAA": 437,
      "GACAAA": 438,
      "TATATT": 439,
      "GGGCC": 440,
      "GAACAA": 441,
      "TGGATT": 442,
      "TGCATT": 443,
      "GGGCA": 444,
      "GCACAA": 445,
      "TCAGCA": 446,
      "TGAGTT": 447,
      "CATAAA": 448,
      "CACAGG": 449,
      "GTACAA": 450,
      "TAGAAA": 451,
      "GCTAC": 452,
      "TGCAAA": 453,
      "TCATAA": 454,
      "TGTCTT": 455,
      "TCTCTG": 456,
      "TCGTG": 457,
      "TCCTGA": 458,
      "GCAATT": 459,
      "TGGCTT": 460,
      "TACACA": 461,
      "GTGCTT": 462,
      "TTCTAA": 463,
      "GAAGC": 464,
      "TTCTCC": 465,
      "CATGGG": 466,
      "GTAGG": 467,
      "TACCAA": 468,
      "TTATAA": 469,
      "TTACTT": 470,
      "CATATT": 471,
      "GTTATT": 472,
      "TAATGA": 473,
      "GCTGGG": 474,
      "TCTTCC": 475,
      "TGCAGA": 476,
      "TTCTTTT": 477,
      "GTACC": 478,
      "AAAATT": 479,
      "GTCCAA": 480,
      "TTATGA": 481,
      "TACATT": 482,
      "TGTTGG": 483,
      "GATGC": 484,
      "GCTGGA": 485,
      "GTAATT": 486,
      "TGTGAA": 487,
      "TAGGC": 488,
      "CATATA": 489,
      "CACAGC": 490,
      "GAACTT": 491,
      "GAAGTT": 492,
      "TACAGA": 493,
      "GCCATT": 494,
      "GATTA": 495,
      "GAGAC": 496,
      "GGTAA": 497,
      "TATCAA": 498,
      "TGTGTT": 499,
      "CATATG": 500,
      "TCCACA": 501,
      "TGGTGA": 502,
      "TTCTTA": 503,
      "TCATTA": 504,
      "TCGGC": 505,
      "TCGTC": 506,
      "CATGTG": 507,
      "CACGG": 508,
      "TGCAGG": 509,
      "TGCTCC": 510,
      "TGAGCA": 511,
      "CCGG": 512,
      "TGTATT": 513,
      "TGCAGC": 514,
      "TGGCAA": 515,
      "TTCTCA": 516,
      "TAAGTT": 517,
      "GCGGC": 518,
      "GAGAAA": 519,
      "GCAGCC": 520,
      "TCTCCC": 521,
      "AAACTT": 522,
      "GCTGCC": 523,
      "CATCCA": 524,
      "TATCTT": 525,
      "CATCAC": 526,
      "TCGAA": 527,
      "TAGCAA": 528,
      "CAGCCC": 529,
      "CAGTAA": 530,
      "GAGTC": 531,
      "TCTATT": 532,
      "TGCTCA": 533,
      "TTCTGA": 534,
      "TTCAAC": 535,
      "CACTGA": 536,
      "GACCC": 537,
      "TATGAA": 538,
      "TTTTCC": 539,
      "AAAGTT": 540,
      "TATGTT": 541,
      "TAGTAA": 542,
      "TTTTGTT": 543,
      "CAGTCA": 544,
      "TACATG": 545,
      "GACAC": 546,
      "TGTCAA": 547,
      "GGACAA": 548,
      "GCGCC": 549,
      "GCTGTT": 550,
      "TGCGG": 551,
      "TACCAC": 552,
      "TCAAAC": 553,
      "TTAGCA": 554,
      "GTGAAA": 555,
      "GGAATT": 556,
      "TGTGGA": 557,
      "GTCCTT": 558,
      "TAGTGA": 559,
      "ATT": 560,
      "CCCAC": 561,
      "GCCAGG": 562,
      "TACCTT": 563,
      "TCAGCC": 564,
      "TGATTA": 565,
      "CCCAAA": 566,
      "TGGTAA": 567,
      "TTCCAC": 568,
      "CAG": 569,
      "TCATCC": 570,
      "TCGTT": 571,
      "TCT": 572,
      "TCGCC": 573,
      "TGATAA": 574,
      "TAGGTT": 575,
      "GAGTA": 576,
      "CACCCC": 577,
      "TCTATA": 578,
      "GAAAGG": 579,
      "TGCCTT": 580,
      "TGGTCA": 581,
      "GCACTT": 582,
      "CAGTTA": 583,
      "CATTCC": 584,
      "TGTGGG": 585,
      "TGAAGG": 586,
      "GTACTT": 587,
      "TATGGA": 588,
      "GGAGAA": 589,
      "TCTTCAA": 590,
      "TGCCAC": 591,
      "CAGAGG": 592,
      "CCAATT": 593,
      "CAT": 594,
      "GTGATT": 595,
      "TCAAGG": 596,
      "GGCGG": 597,
      "GCCGCC": 598,
      "GTGCAA": 599,
      "TGTAAA": 600,
      "TATTGG": 601,
      "TAAAAC": 602,
      "TAATTA": 603,
      "TGCAAC": 604,
      "TGTCCA": 605,
      "GCTTTT": 606,
      "GCAGTT": 607,
      "TAGGAA": 608,
      "GTGGAA": 609,
      "GTCAAA": 610,
      "CCTGAA": 611,
      "TATGTG": 612,
      "TGTATA": 613,
      "TCTGCC": 614,
      "GCAGGA": 615,
      "GTCATT": 616,
      "GAGGAA": 617,
      "CAGAAC": 618,
      "TCCTCA": 619,
      "TGGCTG": 620,
      "GCGGA": 621,
      "TGGAGG": 622,
      "GCAGTG": 623,
      "TGTTCC": 624,
      "CAGGCC": 625,
      "TCTTCTT": 626,
      "GCTGAA": 627,
      "CATTGG": 628,
      "TCGGA": 629,
      "TGCCAA": 630,
      "CACTTA": 631,
      "GATAC": 632,
      "GGCAAA": 633,
      "TCTAGA": 634,
      "GCAGAA": 635,
      "GATTTT": 636,
      "TTCTCTT": 637,
      "CATCCC": 638,
      "CCAAC": 639,
      "TGCTAA": 640,
      "GGAAC": 641,
      "CATTCTT": 642,
      "GTGTTA": 643,
      "GATCC": 644,
      "GCTGTG": 645,
      "CATAGA": 646,
      "CATTAC": 647,
      "GTGGTT": 648,
      "CACAAC": 649,
      "CATCTA": 650,
      "GGCGGC": 651,
      "TAGCAC": 652,
      "TACTGA": 653,
      "TGGAAC": 654,
      "TTTTTTTT": 655,
      "AATT": 656,
      "TCTTGG": 657,
      "TACAGC": 658,
      "GCAGGC": 659,
      "CAGTTC": 660,
      "AAATCA": 661,
      "GTAGTA": 662,
      "GTTTGA": 663,
      "TACAAC": 664,
      "TCCACC": 665,
      "TAGCTT": 666,
      "GTTGAA": 667,
      "GAGGCC": 668,
      "CAACC": 669,
      "TCGTA": 670,
      "TGAGTG": 671,
      "AAAGTA": 672,
      "CAGGAC": 673,
      "CAGTGC": 674,
      "GCGAA": 675,
      "TGGGCC": 676,
      "TAATCA": 677,
      "GCTAAA": 678,
      "TGTATG": 679,
      "TACTAA": 680,
      "GGTCC": 681,
      "CACTTC": 682,
      "GCTCTT": 683,
      "TTATCA": 684,
      "TATTAC": 685,
      "GATTC": 686,
      "TTACAC": 687,
      "CAACAA": 688,
      "GCCAGC": 689,
      "GCCGG": 690,
      "TATCTG": 691,
      "TATTCC": 692,
      "TCAAGAA": 693,
      "TAACAC": 694,
      "GTTTTC": 695,
      "GCATGA": 696,
      "CAGACAA": 697,
      "TTAGTT": 698,
      "CATCTC": 699,
      "TCAGTA": 700,
      "TCTTAC": 701,
      "GCCCCC": 702,
      "GAAGTG": 703,
      "TACATA": 704,
      "AAATAA": 705,
      "TTAATT": 706,
      "TGGTTA": 707,
      "TGCATA": 708,
      "CAGTCC": 709,
      "TGTCTG": 710,
      "TACTCA": 711,
      "TAATTTT": 712,
      "GGCTGC": 713,
      "TAAGGA": 714,
      "GATCTT": 715,
      "GGTGC": 716,
      "TTATTTT": 717,
      "TGGTTC": 718,
      "GGAGCC": 719,
      "CACACC": 720,
      "CCTTAA": 721,
      "TACAGG": 722,
      "GCGTG": 723,
      "TGGAGA": 724,
      "AAATAC": 725,
      "TAAAGA": 726,
      "TGCCCC": 727,
      "CACTCC": 728,
      "TAT": 729,
      "GGAGTT": 730,
      "GTAGAA": 731,
      "GGTTA": 732,
      "GTCTCC": 733,
      "CACTAA": 734,
      "CCAAAA": 735,
      "GGCTTC": 736,
      "TATGGG": 737,
      "CAGTAC": 738,
      "GTAGTG": 739,
      "GGGAC": 740,
      "TGGTCC": 741,
      "GGAGC": 742,
      "CATCAAA": 743,
      "TCAAGA": 744,
      "CACTGC": 745,
      "TACAAAA": 746,
      "GCCTCC": 747,
      "TGTTGTT": 748,
      "TGAGC": 749,
      "GTCACC": 750,
      "AAATTA": 751,
      "TGCACA": 752,
      "GGAGGC": 753,
      "GGACTT": 754,
      "GATGAAA": 755,
      "TGTTAC": 756,
      "TTCTGC": 757,
      "GTAGTT": 758,
      "GTGGCA": 759,
      "TCTATG": 760,
      "TGACAAA": 761,
      "GATTAA": 762,
      "GAGATT": 763,
      "GCCAAA": 764,
      "TGGTGC": 765,
      "GCCCTT": 766,
      "CATGCC": 767,
      "GGGAAA": 768,
      "AAAAAAAA": 769,
      "TCCTGC": 770,
      "TATCTA": 771,
      "TAGAAAA": 772,
      "GGATGA": 773,
      "TCATCTT": 774,
      "GCCCAA": 775,
      "GGTTAA": 776,
      "TGAACAA": 777,
      "CATAAC": 778,
      "TCGCA": 779,
      "CAGGGA": 780,
      "TCTCCAA": 781,
      "CACAAAA": 782,
      "TTCTGTT": 783,
      "TCCAAC": 784,
      "TAGTCA": 785,
      "TTGTT": 786,
      "GCCTCA": 787,
      "TGAACC": 788,
      "TGG": 789,
      "TAGTGC": 790,
      "GAGGAAA": 791,
      "GGCCCC": 792,
      "TCAGAC": 793,
      "CACAGCA": 794,
      "TCCACAA": 795,
      "TGCACC": 796,
      "TGTCAC": 797,
      "CAGAGA": 798,
      "TAAGCA": 799,
      "TATCAC": 800,
      "TGAAAAA": 801,
      "TGGCAC": 802,
      "GGCTCC": 803,
      "TGT": 804,
      "TTCAAAA": 805,
      "GTGGGA": 806,
      "GCTTCC": 807,
      "TGTGCC": 808,
      "GAAACC": 809,
      "GGGTA": 810,
      "GTAAAC": 811,
      "GGCAC": 812,
      "TATACC": 813,
      "TACTTA": 814,
      "TGGTAC": 815,
      "TGGAAAA": 816,
      "TGTTGA": 817,
      "TGAGGC": 818,
      "GAAAAC": 819,
      "TTCTAC": 820,
      "TCTCAC": 821,
      "TGATGC": 822,
      "TAAACAA": 823,
      "TAGTAC": 824,
      "CAGAAAA": 825,
      "GCAACC": 826,
      "CCCTCC": 827,
      "TCAACAA": 828,
      "GTTTTA": 829,
      "TGCAAAA": 830,
      "CAGGGG": 831,
      "GCAAGG": 832,
      "GATGGA": 833,
      "TGACAC": 834,
      "GAATCA": 835,
      "TTAGTA": 836,
      "GCAGTA": 837,
      "TAAAATT": 838,
      "GTTGC": 839,
      "TGTAGA": 840,
      "AAACAC": 841,
      "TGGCCC": 842,
      "GAAGGA": 843,
      "TAAGTG": 844,
      "TAAGTA": 845,
      "TGAAAC": 846,
      "GAAAGA": 847,
      "TGGGGG": 848,
      "TATAAC": 849,
      "TGTTGAA": 850,
      "TTACAAA": 851,
      "TTCAATT": 852,
      "GCTTAA": 853,
      "TCTCAAA": 854,
      "TAATAAA": 855,
      "TGAGTC": 856,
      "TTAGTG": 857,
      "TGGTGTT": 858,
      "GCTATT": 859,
      "GCCACC": 860,
      "TGACCC": 861,
      "TCATGC": 862,
      "TCCAGCC": 863,
      "TATGAC": 864,
      "AAAGCA": 865,
      "GCTCTG": 866,
      "TCGAC": 867,
      "CATGAC": 868,
      "TCCAGCA": 869,
      "GGAAAA": 870,
      "GTTTCC": 871,
      "GCGCA": 872,
      "GCGAC": 873,
      "TGGACC": 874,
      "TGCTTC": 875,
      "GCCACA": 876,
      "TAGTTA": 877,
      "TGTCCC": 878,
      "TCCTAC": 879,
      "GACCTT": 880,
      "GTGGTA": 881,
      "GAAGCA": 882,
      "TAGCCA": 883,
      "TAGCTG": 884,
      "GACTTC": 885,
      "TGCAATT": 886,
      "GCCTGC": 887,
      "TTCTTAA": 888,
      "GCTCAA": 889,
      "TAAGAAA": 890,
      "TACTAC": 891,
      "TCATTTT": 892,
      "TGATCC": 893,
      "TGGACAA": 894,
      "AAAGTG": 895,
      "TAAAAAA": 896,
      "CAGACC": 897,
      "GTTGTA": 898,
      "GTCTTC": 899,
      "CACAGAA": 900,
      "CTTAA": 901,
      "TAAACC": 902,
      "TACACC": 903,
      "TGATCA": 904,
      "CAGAGAA": 905,
      "TGCTGTT": 906,
      "TGCTAC": 907,
      "TGCTGTG": 908,
      "TTAAAAA": 909,
      "TGGAGTG": 910,
      "GTTCCC": 911,
      "TGAAGAA": 912,
      "TTCGG": 913,
      "TCAAATT": 914,
      "GTATTTT": 915,
      "TCCTCTT": 916,
      "GCTCCC": 917,
      "TCTGAC": 918,
      "TGCAGCA": 919,
      "CAAGG": 920,
      "TGTGAC": 921,
      "TAGAAC": 922,
      "CCAAGG": 923,
      "TGCTTA": 924,
      "GGAAGG": 925,
      "GGAGCA": 926,
      "TCCAAAA": 927,
      "GGCTGA": 928,
      "CATTGA": 929,
      "CATGGTG": 930,
      "TTTTAAA": 931,
      "TCAAAAA": 932,
      "CCCTCA": 933,
      "GTAAATT": 934,
      "GAAGCC": 935,
      "CACACAA": 936,
      "TAACAAA": 937,
      "TAGTTC": 938,
      "CACTCA": 939,
      "GGAGTC": 940,
      "GCCAGA": 941,
      "TGAGTA": 942,
      "GAGGGG": 943,
      "TTCCAGG": 944,
      "CCTTCC": 945,
      "TATCCA": 946,
      "TCCAATT": 947,
      "GACGG": 948,
      "TAG": 949,
      "GAAACAA": 950,
      "GGATTA": 951,
      "TCCTAA": 952,
      "TGTACC": 953,
      "TATTAAA": 954,
      "GATC": 955,
      "AAACAAA": 956,
      "TCAAGTT": 957,
      "GAGGAC": 958,
      "TTATTC": 959,
      "TCAACTT": 960,
      "TGGTGAA": 961,
      "TGATAAA": 962,
      "TGCAGCC": 963,
      "GCCATG": 964,
      "TGATGAA": 965,
      "GGAGTG": 966,
      "GCATCA": 967,
      "TCCCAAA": 968,
      "TATAAAA": 969,
      "GACCAC": 970,
      "TGCATG": 971,
      "TACTTC": 972,
      "TGCAGTT": 973,
      "TATTGA": 974,
      "CCCGG": 975,
      "TCAACC": 976,
      "TTCCATT": 977,
      "CACAATT": 978,
      "GCGTC": 979,
      "CACAGGA": 980,
      "TCGCTG": 981,
      "TCCTTA": 982,
      "TGCTTTT": 983,
      "TCGGCC": 984,
      "GCCATA": 985,
      "CATTGAA": 986,
      "TAATAC": 987,
      "TCCTTC": 988,
      "TAATTC": 989,
      "TACCCAA": 990,
      "TGTCTC": 991,
      "TATACAA": 992,
      "GATTCC": 993,
      "GACTCA": 994,
      "GGTTC": 995,
      "TGAGAAA": 996,
      "TTTTGTG": 997,
      "GCTCTC": 998,
      "GTCAAC": 999,
      "GTTGCA": 1000,
      "AAAGGA": 1001,
      "GATGAA": 1002,
      "GCT": 1003,
      "TCATTC": 1004,
      "TGATTGG": 1005,
      "TCCCAC": 1006,
      "TCAGTC": 1007,
      "GACCAA": 1008,
      "TCTTGTT": 1009,
      "GTATTA": 1010,
      "GCCTGA": 1011,
      "GGAACAA": 1012,
      "TACTGTT": 1013,
      "TAAAGG": 1014,
      "GCTATA": 1015,
      "GCATTA": 1016,
      "CACTAC": 1017,
      "TCCAGTT": 1018,
      "GCAAAC": 1019,
      "GACTTA": 1020,
      "TGGCAAA": 1021,
      "CAGCCAC": 1022,
      "GGGTC": 1023,
      "GCACAC": 1024,
      "GCATAA": 1025,
      "TGAACTT": 1026,
      "CATACC": 1027,
      "TCCTGGA": 1028,
      "TACTTTT": 1029,
      "GAAAATT": 1030,
      "GCGTT": 1031,
      "GAAGAAA": 1032,
      "TGTTGTC": 1033,
      "TCCTTGG": 1034,
      "GGGAGA": 1035,
      "GAGCAA": 1036,
      "TCATCAA": 1037,
      "TCTCATT": 1038,
      "TCTGGAA": 1039,
      "TAAACTT": 1040,
      "GGCCAC": 1041,
      "TGGGAAA": 1042,
      "GAGTGA": 1043,
      "GGCTAA": 1044,
      "TTCTTCC": 1045,
      "GAGTCA": 1046,
      "CCCTTA": 1047,
      "GGTCTT": 1048,
      "TGGAATT": 1049,
      "CATGCAA": 1050,
      "GGCGCC": 1051,
      "CATTGTC": 1052,
      "TTAGGA": 1053,
      "GTTAAA": 1054,
      "TAAGC": 1055,
      "TATTCAA": 1056,
      "TGCTGGA": 1057,
      "TAATGAA": 1058,
      "TGATATT": 1059,
      "GTGCAC": 1060,
      "CAGGGCC": 1061,
      "CCTTGG": 1062,
      "AAATTC": 1063,
      "GTTGGA": 1064,
      "TGGGAC": 1065,
      "TGAAATT": 1066,
      "TGTGGTG": 1067,
      "TACTGC": 1068,
      "TAGAGA": 1069,
      "TAATGTT": 1070,
      "TGAGCC": 1071,
      "TCCAGAA": 1072,
      "TAATTGG": 1073,
      "GGTTTT": 1074,
      "TCTGCAA": 1075,
      "TGCAGAA": 1076,
      "TGATGTT": 1077,
      "GTTGTG": 1078,
      "GCTGGTG": 1079,
      "GTCCCC": 1080,
      "TCTCTAA": 1081,
      "TGATTTT": 1082,
      "CAGTTTT": 1083,
      "TCGAGG": 1084,
      "GCTTGG": 1085,
      "TCAACCC": 1086,
      "GAAGAC": 1087,
      "GTTTAA": 1088,
      "TCTTGTG": 1089,
      "GGAGAC": 1090,
      "CAGCAAA": 1091,
      "TATTTTA": 1092,
      "CAGAGCC": 1093,
      "GATGTT": 1094,
      "GATAAA": 1095,
      "GCTATG": 1096,
      "TTCTGTG": 1097,
      "ACC": 1098,
      "GGTTGG": 1099,
      "TCCGG": 1100,
      "CAGTCAA": 1101,
      "TCAGGAA": 1102,
      "GTGGTC": 1103,
      "TGCCATT": 1104,
      "GTAGCA": 1105,
      "TCAGATT": 1106,
      "AGG": 1107,
      "CAGATTC": 1108,
      "TATTCTT": 1109,
      "GCTGAC": 1110,
      "TGTTTTA": 1111,
      "TGAAGTG": 1112,
      "GAGAAC": 1113,
      "CCCTGC": 1114,
      "TCCTGTG": 1115,
      "TCTACAA": 1116,
      "TCGGGG": 1117,
      "TGATAC": 1118,
      "TCCACTT": 1119,
      "TCCATCA": 1120,
      "GGAACC": 1121,
      "CATTCAA": 1122,
      "GATCAA": 1123,
      "GTGGCC": 1124,
      "GCAGAAA": 1125,
      "TAGTCC": 1126,
      "TACACAA": 1127,
      "GTAGGA": 1128,
      "TTATTAA": 1129,
      "GTTTCA": 1130,
      "TCCCATT": 1131,
      "TGTTAAA": 1132,
      "GCTCCA": 1133,
      "TGGTTTT": 1134,
      "TCTACC": 1135,
      "CAAAAA": 1136,
      "GAACAAA": 1137,
      "CAGCTAC": 1138,
      "CATAAAA": 1139,
      "TGTTTTC": 1140,
      "GACATT": 1141,
      "CAGCCAA": 1142,
      "TATTGAA": 1143,
      "CACCATG": 1144,
      "CAGTGAA": 1145,
      "TGAGAC": 1146,
      "TGTAGAA": 1147,
      "TCCCCC": 1148,
      "TCTGATT": 1149,
      "TCCATTA": 1150,
      "TACCAGA": 1151,
      "TCAGGC": 1152,
      "GGACCC": 1153,
      "CAAGAA": 1154,
      "TCTGCTG": 1155,
      "GACTGC": 1156,
      "TCTAAAA": 1157,
      "GCCTTC": 1158,
      "GCTCAC": 1159,
      "TTTTGGA": 1160,
      "CAGCATT": 1161,
      "TGTGTGTG": 1162,
      "TAAAGAA": 1163,
      "GCCAAC": 1164,
      "TGGGGA": 1165,
      "TCAGAAA": 1166,
      "AAAAGAA": 1167,
      "CATTCTG": 1168,
      "TCAGCAA": 1169,
      "GACTGAA": 1170,
      "CACCACC": 1171,
      "TGGAGAA": 1172,
      "TATTGTT": 1173,
      "CACGTG": 1174,
      "TACAGAA": 1175,
      "GTAGAC": 1176,
      "GTGACAA": 1177,
      "TGCTCTT": 1178,
      "GCTACC": 1179,
      "CCTTGA": 1180,
      "CATCAAAA": 1181,
      "TGATTTG": 1182,
      "CACCAGC": 1183,
      "GCATCC": 1184,
      "GCACCC": 1185,
      "TCATAC": 1186,
      "GGTTCC": 1187,
      "GTCCTCC": 1188,
      "TTATGTT": 1189,
      "TATTATT": 1190,
      "GCAGAGA": 1191,
      "TGTAGG": 1192,
      "GCAAAAA": 1193,
      "CAGTTAA": 1194,
      "GCTACA": 1195,
      "GGTAC": 1196,
      "TCGCTT": 1197,
      "TTCTCCA": 1198,
      "TCGGAA": 1199,
      "TGCTGGG": 1200,
      "TGTTGTA": 1201,
      "GTCTTA": 1202,
      "TTATAAA": 1203,
      "TCTGGTT": 1204,
      "GCGGCC": 1205,
      "CAGCTCC": 1206,
      "GTAACAA": 1207,
      "TAACATT": 1208,
      "GAAACTT": 1209,
      "TGTGGTT": 1210,
      "CATCCTT": 1211,
      "TGTTGATT": 1212,
      "CAGGAAC": 1213,
      "TTCTTCTT": 1214,
      "CAAGCA": 1215,
      "CACACACA": 1216,
      "TGCTGAA": 1217,
      "GTCTTCC": 1218,
      "TTCTGAA": 1219,
      "CATAGG": 1220,
      "GAAGAGA": 1221,
      "CATACAA": 1222,
      "TAGAAGA": 1223,
      "GTGCCC": 1224,
      "GGCCAA": 1225,
      "CACGA": 1226,
      "TGGATGA": 1227,
      "TAGTGAA": 1228,
      "TCTAGTG": 1229,
      "TCGTCC": 1230,
      "TGTTCTT": 1231,
      "GCCTTA": 1232,
      "TTCTCAA": 1233,
      "GGACAAA": 1234,
      "TCTCCTT": 1235,
      "GAATAC": 1236,
      "GTGTCC": 1237,
      "TCACCC": 1238,
      "GAATAA": 1239,
      "CATTAAA": 1240,
      "TATCTC": 1241,
      "TCAGTGA": 1242,
      "TGCTTGG": 1243,
      "TCTGAAA": 1244,
      "CCTTA": 1245,
      "GACAGA": 1246,
      "GTTACTT": 1247,
      "TGTAAAA": 1248,
      "TCCAGGA": 1249,
      "CACCAAA": 1250,
      "TCGAAA": 1251,
      "TCTTTAA": 1252,
      "GTATGA": 1253,
      "TCCTTTT": 1254,
      "GGGACC": 1255,
      "GATGGTG": 1256,
      "TCTTATT": 1257,
      "CACCAGA": 1258,
      "GAAGTC": 1259,
      "TCTGCTT": 1260,
      "GAGCTG": 1261,
      "GCCTTCC": 1262,
      "TGGGGTT": 1263,
      "TCCAGGC": 1264,
      "TCATTGA": 1265,
      "CAGAAAC": 1266,
      "CACCACA": 1267,
      "GGCTATG": 1268,
      "TCAAAGG": 1269,
      "CAGGAAA": 1270,
      "TGGCCAA": 1271,
      "GTTTAC": 1272,
      "TATCCC": 1273,
      "TTAGC": 1274,
      "GAAATAA": 1275,
      "TCTGGCC": 1276,
      "CAGTAAA": 1277,
      "TGTACTT": 1278,
      "TGTCTA": 1279,
      "GCATCTG": 1280,
      "CCAACC": 1281,
      "TCGTCA": 1282,
      "TAAGTC": 1283,
      "TGGGCAA": 1284,
      "CACACTT": 1285,
      "GTGAAC": 1286,
      "GTTGTC": 1287,
      "TTTGAAA": 1288,
      "GATGGC": 1289,
      "CATCATT": 1290,
      "TCACAC": 1291,
      "GGCAGA": 1292,
      "TGATTC": 1293,
      "CAACAC": 1294,
      "TCTCTTTT": 1295,
      "TGTAAC": 1296,
      "TGCCACA": 1297,
      "TATTGTA": 1298,
      "TTTTGCA": 1299,
      "CATGGC": 1300,
      "GAGGCAA": 1301,
      "GACTCC": 1302,
      "GTGTGA": 1303,
      "TATTGCA": 1304,
      "TTATATA": 1305,
      "GGATCA": 1306,
      "TTACCC": 1307,
      "TGAAAAC": 1308,
      "GGAAAAA": 1309,
      "TGTCAAA": 1310,
      "TTTTTAA": 1311,
      "TATAATT": 1312,
      "GCCAAAA": 1313,
      "TCGCCC": 1314,
      "TGCTGCC": 1315,
      "TTAGTAA": 1316,
      "GGCTAC": 1317,
      "TCTAGAA": 1318,
      "GAGACC": 1319,
      "TCTTAAA": 1320,
      "CACGGA": 1321,
      "TGCGTG": 1322,
      "CATTTCC": 1323,
      "TGGAGTT": 1324,
      "TAGGCC": 1325,
      "TATGCC": 1326,
      "ACAA": 1327,
      "GTCAATT": 1328,
      "CACCAGG": 1329,
      "TCGTGA": 1330,
      "TAGTCTT": 1331,
      "GGTGGA": 1332,
      "GACATG": 1333,
      "TCACAAA": 1334,
      "TAGGAC": 1335,
      "GCTTAC": 1336,
      "GTCTGC": 1337,
      "GATTGG": 1338,
      "CAAAATT": 1339,
      "CATCAAC": 1340,
      "GTGGAC": 1341,
      "TCATGA": 1342,
      "CCCTGA": 1343,
      "TATATATA": 1344,
      "TCTAAC": 1345,
      "GAAGTA": 1346,
      "GGCTGGA": 1347,
      "GAAGGAA": 1348,
      "GTCGG": 1349,
      "GTGAAAA": 1350,
      "CATCCAA": 1351,
      "GCAGAC": 1352,
      "TCTTGA": 1353,
      "TGATGGA": 1354,
      "TGGTAAA": 1355,
      "CAGAATT": 1356,
      "CAGCAGG": 1357,
      "TGTTGC": 1358,
      "TACTCC": 1359,
      "TCTTGGA": 1360,
      "CATTTAA": 1361,
      "CATGGTA": 1362,
      "TACGG": 1363,
      "TCTCTTC": 1364,
      "TTTTGGC": 1365,
      "TGATGTG": 1366,
      "GTGTGC": 1367,
      "AAAGTCA": 1368,
      "TCGGTT": 1369,
      "CAGTGTT": 1370,
      "GAATTA": 1371,
      "TATCTAA": 1372,
      "CCCCAC": 1373,
      "TGGGGCA": 1374,
      "GCAAAAC": 1375,
      "TAGGGG": 1376,
      "CACCAAC": 1377,
      "GTCTCCC": 1378,
      "TGAGGAA": 1379,
      "CCCTC": 1380,
      "TGGAACC": 1381,
      "CAGCAAC": 1382,
      "GTTACAA": 1383,
      "TACAATT": 1384,
      "CAGGGGA": 1385,
      "TAGTTTT": 1386,
      "TTTTCATT": 1387,
      "TTATAC": 1388,
      "AGA": 1389,
      "GGCTCA": 1390,
      "TAGCCC": 1391,
      "TACAGTT": 1392,
      "TTCTATT": 1393,
      "GCTTCTT": 1394,
      "GGCTGAA": 1395,
      "GTAAAAA": 1396,
      "TTATATT": 1397,
      "TAACGG": 1398,
      "TGCACAA": 1399,
      "TTCGA": 1400,
      "TATCATT": 1401,
      "TCTTTTAA": 1402,
      "TTAACAA": 1403,
      "TTTTTCA": 1404,
      "TGTAGTT": 1405,
      "GGCTGGG": 1406,
      "TGATAGA": 1407,
      "TCGATT": 1408,
      "GGATCC": 1409,
      "CAGCCCC": 1410,
      "GCAGTGA": 1411,
      "TATAGG": 1412,
      "CACTTCC": 1413,
      "CACAGTG": 1414,
      "TGAGCAA": 1415,
      "CATTTTA": 1416,
      "GAGAGG": 1417,
      "TTCTGGA": 1418,
      "GTTCAAC": 1419,
      "GACCCC": 1420,
      "GTAGC": 1421,
      "GCATTTT": 1422,
      "TGAAGTT": 1423,
      "TGAGTCA": 1424,
      "ACTT": 1425,
      "TCAAAAC": 1426,
      "GATGTG": 1427,
      "TACCATT": 1428,
      "CACTGCC": 1429,
      "GCTGGAA": 1430,
      "GTCTTGG": 1431,
      "CAGGATT": 1432,
      "GTGTAA": 1433,
      "GCATCTT": 1434,
      "TTCTAAA": 1435,
      "GCAAGAA": 1436,
      "CATGGAA": 1437,
      "CACTGGA": 1438,
      "GGCCAGG": 1439,
      "CATTGTT": 1440,
      "TCACTGGG": 1441,
      "GTGACC": 1442,
      "GTGTAC": 1443,
      "TCTGCCC": 1444,
      "GTCTCA": 1445,
      "TACTGAA": 1446,
      "TGTCCTT": 1447,
      "AAAAGG": 1448,
      "TGTACAA": 1449,
      "TATGCAA": 1450,
      "TGTTTCA": 1451,
      "CCAAGAA": 1452,
      "TGGATGC": 1453,
      "GTGCAAA": 1454,
      "GATATA": 1455,
      "GCAACAA": 1456,
      "TAGAGG": 1457,
      "TAGACC": 1458,
      "TAAAGTT": 1459,
      "CCCTCTT": 1460,
      "CACAGTC": 1461,
      "GGAGGAA": 1462,
      "TTTTGAA": 1463,
      "GCCAATT": 1464,
      "TAATTAA": 1465,
      "GTGGAAA": 1466,
      "GTACAAA": 1467,
      "TTCCAGA": 1468,
      "TACCCC": 1469,
      "TCTAGG": 1470,
      "CACAGTT": 1471,
      "TTAGAAA": 1472,
      "TTAGGC": 1473,
      "TATATGTG": 1474,
      "GACCAAA": 1475,
      "TAATCC": 1476,
      "GACGA": 1477,
      "TGCAGGA": 1478,
      "GAAAAGG": 1479,
      "TCCAGTC": 1480,
      "AACTCA": 1481,
      "CTTCC": 1482,
      "TGCTGCAA": 1483,
      "TCTAGCA": 1484,
      "GTGGGC": 1485,
      "TCGTGC": 1486,
      "GCAGCTG": 1487,
      "GCTGATT": 1488,
      "TGCGA": 1489,
      "GTCAAAA": 1490,
      "TGTGCAA": 1491,
      "TCGCCA": 1492,
      "AAAGAAA": 1493,
      "TGATGAC": 1494,
      "CAGAAATT": 1495,
      "GTATAA": 1496,
      "TGACATT": 1497,
      "TTCTACA": 1498,
      "TTATCTT": 1499,
      "GTTTTAA": 1500,
      "CAGCTCA": 1501,
      "TGCCAGG": 1502,
      "TTATCC": 1503,
      "CTTGG": 1504,
      "CCCGA": 1505,
      "GGATAA": 1506,
      "GTATGC": 1507,
      "GAGGATT": 1508,
      "TTCTCTG": 1509,
      "TTCTATA": 1510,
      "TGTTCAC": 1511,
      "CCAACAA": 1512,
      "TCCTGCC": 1513,
      "TGTTGTG": 1514,
      "CATGACC": 1515,
      "CAGAGTG": 1516,
      "TGTTCAA": 1517,
      "CAGTTGAA": 1518,
      "TATCAAA": 1519,
      "GATATG": 1520,
      "TCCTGAA": 1521,
      "TCTGAAC": 1522,
      "GAGAGCA": 1523,
      "TCTTTGA": 1524,
      "TAATGGA": 1525,
      "TTGACC": 1526,
      "GGATTTT": 1527,
      "GCGGGG": 1528,
      "GTCCAAA": 1529,
      "TGCCATC": 1530,
      "GTCAGG": 1531,
      "TGTGAAA": 1532,
      "TCCTGGG": 1533,
      "CATTATT": 1534,
      "CATGGTT": 1535,
      "TCATAAA": 1536,
      "GACTGA": 1537,
      "CCAAAAA": 1538,
      "CAGCTGC": 1539,
      "GAAAGAA": 1540,
      "GGAGTAA": 1541,
      "TGAATGTG": 1542,
      "TTCTGGG": 1543,
      "TTGGGA": 1544,
      "GTTTCTT": 1545,
      "TGTCCAA": 1546,
      "AAAAGA": 1547,
      "CAGTGAC": 1548,
      "GTGAGG": 1549,
      "GCCTCTT": 1550,
      "AAATGA": 1551,
      "GCAAGA": 1552,
      "TGTTATT": 1553,
      "TGGAAGTT": 1554,
      "CAGAGTT": 1555,
      "GAAGGC": 1556,
      "GTAAGGA": 1557,
      "AAAACAA": 1558,
      "GCGGGA": 1559,
      "GTACAAC": 1560,
      "TCTATTA": 1561,
      "TGTGTTC": 1562,
      "TCCACCC": 1563,
      "TCGAAC": 1564,
      "GGATGC": 1565,
      "TGGTCAA": 1566,
      "CAGACAC": 1567,
      "TGTCATT": 1568,
      "TAGTAAA": 1569,
      "GTCTGA": 1570,
      "GGAAAAC": 1571,
      "TCTGGTG": 1572,
      "CACAGAC": 1573,
      "TATCTGA": 1574,
      "CCTTCAA": 1575,
      "TCGGGA": 1576,
      "TTCTTGA": 1577,
      "TCCAGTG": 1578,
      "GCCCAGG": 1579,
      "TTCTGGTA": 1580,
      "TATGATT": 1581,
      "TCCTGTT": 1582,
      "TTCCAGC": 1583,
      "CAAA": 1584,
      "TCTGTCA": 1585,
      "GCGCCC": 1586,
      "TCTACTT": 1587,
      "GTTGGC": 1588,
      "GATTTTA": 1589,
      "TTTATAA": 1590,
      "GCGTA": 1591,
      "TATGTAA": 1592,
      "CACATCC": 1593,
      "TTTTAAAA": 1594,
      "TGTGGC": 1595,
      "GCAGTC": 1596,
      "TTCT": 1597,
      "CAAGTT": 1598,
      "TGCACTT": 1599,
      "TATGGTG": 1600,
      "CATTGCC": 1601,
      "GAAAGTG": 1602,
      "TTCTGCA": 1603,
      "CACCCAA": 1604,
      "TGGAGGA": 1605,
      "GCAGCAC": 1606,
      "TGCTGTA": 1607,
      "GGGGCC": 1608,
      "GTATAAA": 1609,
      "AGAA": 1610,
      "GGAAGA": 1611,
      "TTAGTC": 1612,
      "TGTTTGC": 1613,
      "TCTAAAC": 1614,
      "TGGTGGA": 1615,
      "CAGAGAC": 1616,
      "CATCTCC": 1617,
      "TCAGCTT": 1618,
      "TTTTGTA": 1619,
      "GGCAGC": 1620,
      "TAGGGAA": 1621,
      "TTTGTAA": 1622,
      "GGCATT": 1623,
      "TCTTTCC": 1624,
      "TGAAGCA": 1625,
      "GTGCTGGGA": 1626,
      "CACCCTT": 1627,
      "GTCCAC": 1628,
      "TGCCATCA": 1629,
      "CAACAAA": 1630,
      "TCTGGGA": 1631,
      "GCACATT": 1632,
      "TGTGATT": 1633,
      "CATAATT": 1634,
      "TGCAGTG": 1635,
      "GCCCAC": 1636,
      "CATGGAC": 1637,
      "TCTCTCC": 1638,
      "TGTCTTA": 1639,
      "TTAAA": 1640,
      "TCTGGGC": 1641,
      "GAGTGC": 1642,
      "CAGCACC": 1643,
      "GCCGGC": 1644,
      "GCGGGC": 1645,
      "TTATGC": 1646,
      "TATGCTT": 1647,
      "TTTTAAC": 1648,
      "TTTTTCTT": 1649,
      "GTGTTAC": 1650,
      "CAACTT": 1651,
      "TATAGTT": 1652,
      "TAAAAAC": 1653,
      "TATTTATT": 1654,
      "CAAGTA": 1655,
      "TGAAGATT": 1656,
      "GGAGAAA": 1657,
      "CATAGAA": 1658,
      "TCTGTTC": 1659,
      "TCAACAC": 1660,
      "GTCAGTG": 1661,
      "GTACAC": 1662,
      "GTAGTGC": 1663,
      "CAGCCTT": 1664,
      "TCACCAA": 1665,
      "TCATTGTT": 1666,
      "TATTTGA": 1667,
      "CAGAAGA": 1668,
      "TGGATCTT": 1669,
      "GTAGTCA": 1670,
      "TGCAAGG": 1671,
      "TAGTGTT": 1672,
      "GTTACC": 1673,
      "TCTATCA": 1674,
      "TGTGGAA": 1675,
      "GTAATGA": 1676,
      "TTACATT": 1677,
      "GCCAGGA": 1678,
      "GGGAGG": 1679,
      "CATGTAC": 1680,
      "AACTAA": 1681,
      "GCCTGGG": 1682,
      "GCTGGGC": 1683,
      "TAATTGA": 1684,
      "TCGATA": 1685,
      "GAGACAA": 1686,
      "AACTATT": 1687,
      "TCATGAC": 1688,
      "GATTGAA": 1689,
      "TAATATT": 1690,
      "GAAAACAA": 1691,
      "CAGGGGCC": 1692,
      "CACCTCC": 1693,
      "TTATCAA": 1694,
      "CCAAGA": 1695,
      "GCCATCA": 1696,
      "TGACCTT": 1697,
      "TCCAGTA": 1698,
      "GAGGGA": 1699,
      "CAGGCCC": 1700,
      "GCAAATT": 1701,
      "TTCAAAC": 1702,
      "TCGCAA": 1703,
      "TGCATTTT": 1704,
      "GCTGCTG": 1705,
      "GCCAGAA": 1706,
      "TGAAGGA": 1707,
      "AAACCAC": 1708,
      "CATATCA": 1709,
      "TCCTTAA": 1710,
      "TATAGA": 1711,
      "TCCACAC": 1712,
      "TAATTTA": 1713,
      "TACAGGA": 1714,
      "TAAGAC": 1715,
      "TCTTGAA": 1716,
      "CACACCC": 1717,
      "TAGTCAA": 1718,
      "TATTTTAA": 1719,
      "TGCTTCC": 1720,
      "TAGAAAC": 1721,
      "GCTCTCA": 1722,
      "TACTTAA": 1723,
      "GCACAAA": 1724,
      "GCTAGA": 1725,
      "TGACCAC": 1726,
      "CAGGCAA": 1727,
      "TATGGTT": 1728,
      "CAGGAAAC": 1729,
      "TAATAGA": 1730,
      "TCAGGTT": 1731,
      "TCTCAAAA": 1732,
      "TCACCTT": 1733,
      "TAATATG": 1734,
      "GGCCAGA": 1735,
      "GCAGCAAA": 1736,
      "GAGGGCC": 1737,
      "GTGTTGA": 1738,
      "TCTAATT": 1739,
      "GAACTAA": 1740,
      "GCCTCTC": 1741,
      "TTCTCTA": 1742,
      "CCTTTT": 1743,
      "GCTGGTT": 1744,
      "TCCTTTA": 1745,
      "GACACC": 1746,
      "GTGCCAA": 1747,
      "TAAGGAA": 1748,
      "AAAGAC": 1749,
      "TTCCATA": 1750,
      "TTCCACC": 1751,
      "GCTCTGC": 1752,
      "GAGCAC": 1753,
      "GAACATG": 1754,
      "GGAGGAC": 1755,
      "TCCCAGCAC": 1756,
      "GGGGAAA": 1757,
      "TAGCATT": 1758,
      "GAAATGC": 1759,
      "CCTGC": 1760,
      "TTCTTGG": 1761,
      "TCGACC": 1762,
      "GTCCAGC": 1763,
      "GGAGGCC": 1764,
      "TAAACAC": 1765,
      "GTGTTC": 1766,
      "TAGAATT": 1767,
      "CAGGGTG": 1768,
      "TGTTAAAA": 1769,
      "GACTAA": 1770,
      "CACTAAA": 1771,
      "CATGCTT": 1772,
      "TCACTGA": 1773,
      "TCAGCTG": 1774,
      "GAGCTT": 1775,
      "TGAGTGC": 1776,
      "TGCATAA": 1777,
      "TGTTTAC": 1778,
      "GGAGAGA": 1779,
      "GGTCCA": 1780,
      "CATCACC": 1781,
      "TGAAGCC": 1782,
      "TAAATTTT": 1783,
      "TAGAGAA": 1784,
      "TGTCTCC": 1785,
      "GTTGATT": 1786,
      "CATACTT": 1787,
      "TTCGGA": 1788,
      "GTTGCC": 1789,
      "TGAAGCAA": 1790,
      "TCTGTCC": 1791,
      "TACTGGA": 1792,
      "GGAGCTG": 1793,
      "TAATCAA": 1794,
      "CAGGGAA": 1795,
      "GCAGCAA": 1796,
      "CCCCATG": 1797,
      "TGTAATT": 1798,
      "AAAACC": 1799,
      "TGTATTTT": 1800,
      "GGCTGCA": 1801,
      "GTCTCAA": 1802,
      "TCCGCC": 1803,
      "GTAGCTG": 1804,
      "GACTAC": 1805,
      "GGCTGTG": 1806,
      "TCAGTTA": 1807,
      "TCGTTC": 1808,
      "CATGAAA": 1809,
      "GCATATA": 1810,
      "TTCTTCAA": 1811,
      "TGCCGTT": 1812,
      "GCATTAA": 1813,
      "TAACAAAA": 1814,
      "TAATGC": 1815,
      "TAGGAGA": 1816,
      "GGGACAA": 1817,
      "CAGAGGA": 1818,
      "TTAGTGA": 1819,
      "GTTTCAA": 1820,
      "GAG": 1821,
      "TATATTTT": 1822,
      "TACTGTG": 1823,
      "GAGCCC": 1824,
      "TTACTTA": 1825,
      "TACATATG": 1826,
      "TCGCAC": 1827,
      "TGAATCA": 1828,
      "CAGT": 1829,
      "TTCCCAA": 1830,
      "CACAGCC": 1831,
      "CATGAAAA": 1832,
      "GATTTGTT": 1833,
      "CAGTTCTT": 1834,
      "GAACCATT": 1835,
      "CATGTTC": 1836,
      "CATTACC": 1837,
      "CATTGTG": 1838,
      "TAAGAGA": 1839,
      "CAGTATT": 1840,
      "GCTGCTT": 1841,
      "CATATTTT": 1842,
      "GACAGC": 1843,
      "TTCCCC": 1844,
      "GCAGCTT": 1845,
      "CACGCC": 1846,
      "GTGATGA": 1847,
      "CCTTGTT": 1848,
      "CAGTCTT": 1849,
      "TCTTGCTT": 1850,
      "GTAGTC": 1851,
      "TGGGGTG": 1852,
      "TGCTTCAA": 1853,
      "CACCATT": 1854,
      "TATTGTG": 1855,
      "GCCAGTT": 1856,
      "GTATGTT": 1857,
      "GTAGCC": 1858,
      "CACTCCA": 1859,
      "TTCCATG": 1860,
      "TAGCAAA": 1861,
      "TCATTTCA": 1862,
      "GCTCTA": 1863,
      "TCCAGGAA": 1864,
      "TCG": 1865,
      "TCTGGTGA": 1866,
      "GGCAGG": 1867,
      "GCGCTG": 1868,
      "CATTCCAA": 1869,
      "TGAAAAAA": 1870,
      "TATGAAA": 1871,
      "CCTTCCTT": 1872,
      "CATGCTG": 1873,
      "TAAAGCAA": 1874,
      "GCGTCA": 1875,
      "CACAAAAA": 1876,
      "TTACAGG": 1877,
      "CCCTAA": 1878,
      "GCTGAGG": 1879,
      "TATATAA": 1880,
      "GACAAC": 1881,
      "TCCATGTT": 1882,
      "CATTTGC": 1883,
      "TGAAAGAA": 1884,
      "TCACAGA": 1885,
      "GTACCC": 1886,
      "TCTTCCC": 1887,
      "TGAGAAC": 1888,
      "TGTTAAC": 1889,
      "TGGCATT": 1890,
      "TGGATAA": 1891,
      "GAGAACAA": 1892,
      "TGGCCTT": 1893,
      "CACATCA": 1894,
      "GGTGGC": 1895,
      "TCTCTATT": 1896,
      "TGTTCTG": 1897,
      "TCAAGGA": 1898,
      "GAGAAGA": 1899,
      "TACAAAC": 1900,
      "TAACAGC": 1901,
      "GTCTAA": 1902,
      "CAGGAAAA": 1903,
      "AACCAC": 1904,
      "GCTCTTC": 1905,
      "TGCAACC": 1906,
      "TATGTTTT": 1907,
      "TGTCCAC": 1908,
      "TCATTAA": 1909,
      "CAGGGTT": 1910,
      "TAGCTCCA": 1911,
      "TGCTTTG": 1912,
      "TGAGAGA": 1913,
      "GCTAAAA": 1914,
      "GGGCCC": 1915,
      "GCAACACC": 1916,
      "TTGGAAA": 1917,
      "GCTTGAA": 1918,
      "GGTTGTT": 1919,
      "TGGGGAA": 1920,
      "TCTGGAC": 1921,
      "TATATGC": 1922,
      "GGCTTA": 1923,
      "GTAAAATT": 1924,
      "TGAATCAA": 1925,
      "CCCCC": 1926,
      "GTGTCTT": 1927,
      "TACAGCA": 1928,
      "GAGTTA": 1929,
      "GGCTGCC": 1930,
      "TGGGATT": 1931,
      "GTAACTT": 1932,
      "TATTAAAA": 1933,
      "GTGAGAAA": 1934,
      "GTGACTT": 1935,
      "GTGTTTT": 1936,
      "CACTGTG": 1937,
      "CACTGAA": 1938,
      "TCTCGG": 1939,
      "TTACTGA": 1940,
      "TTAGAC": 1941,
      "TGGCGA": 1942,
      "TTATGAC": 1943,
      "TACTCAA": 1944,
      "TGACTCA": 1945,
      "GGAGGGG": 1946,
      "CACATGA": 1947,
      "GGTGGG": 1948,
      "CAGGTGC": 1949,
      "AAACTAA": 1950,
      "CAGAGCA": 1951,
      "CAGCTGA": 1952,
      "GTTAATT": 1953,
      "CCTTAAA": 1954,
      "GTCCCAA": 1955,
      "GTCTTTT": 1956,
      "TCTTCAAA": 1957,
      "TACACTT": 1958,
      "TACTCAC": 1959,
      "TACACAC": 1960,
      "CATTCACA": 1961,
      "TGTGTAA": 1962,
      "GAGGGAA": 1963,
      "TCGCTGA": 1964,
      "AAACTTA": 1965,
      "GCCTAC": 1966,
      "TAAATAA": 1967,
      "TGGATCA": 1968,
      "TGGATCC": 1969,
      "TAAATTA": 1970,
      "GACTTTT": 1971,
      "TCGGGC": 1972,
      "CACCAGCC": 1973,
      "GGTTGA": 1974,
      "TGTAGTG": 1975,
      "CATTAAAA": 1976,
      "TGACAGA": 1977,
      "TCCCAGG": 1978,
      "TGGAGAAA": 1979,
      "TGCT": 1980,
      "GCTTCAA": 1981,
      "TGAAGTA": 1982,
      "GACACA": 1983,
      "GCCCATA": 1984,
      "GAGAGGA": 1985,
      "GCCAGGC": 1986,
      "TCCAAGG": 1987,
      "GATGGG": 1988,
      "TGCCAGA": 1989,
      "TAAAACC": 1990,
      "TCGTAA": 1991,
      "GTGGTCA": 1992,
      "GCTGCCC": 1993,
      "GGAAGAA": 1994,
      "TAACAAC": 1995,
      "TGTTGAC": 1996,
      "TGGTATT": 1997,
      "CACTGGG": 1998,
      "TACCCTT": 1999,
      "GTGGCTT": 2000,
      "CATTTGA": 2001,
      "GCATCAA": 2002,
      "CACTACC": 2003,
      "TAGACAA": 2004,
      "TGCTCTA": 2005,
      "CCAAGTG": 2006,
      "TCATATT": 2007,
      "CATCTATT": 2008,
      "GGTCAA": 2009,
      "CAGATGGC": 2010,
      "TAGAGTT": 2011,
      "GGACCAA": 2012,
      "CATTCAC": 2013,
      "GACTCAA": 2014,
      "AGTT": 2015,
      "TCCCACC": 2016,
      "GACTCTT": 2017,
      "GCATGTT": 2018,
      "TCCTTCC": 2019,
      "TGCTATA": 2020,
      "CACTTTG": 2021,
      "GCTGGAC": 2022,
      "TGTATGA": 2023,
      "TAGGCAA": 2024,
      "GTACCAA": 2025,
      "CAGTTAC": 2026,
      "GACTGGTG": 2027,
      "GGCGGA": 2028,
      "GGCTATA": 2029,
      "TCTGAAAA": 2030,
      "TGGAGCA": 2031,
      "GAT": 2032,
      "TCCTAAA": 2033,
      "AAAAAAA": 2034,
      "GTGGGTT": 2035,
      "GTGGGAA": 2036,
      "GGGAGAA": 2037,
      "TGGTCTT": 2038,
      "TGACCAA": 2039,
      "TGAAGTC": 2040,
      "TGGGCCC": 2041,
      "CAGCGCC": 2042,
      "TCGGAC": 2043,
      "GATCTG": 2044,
      "TGCTCAA": 2045,
      "CATTTCTT": 2046,
      "TGTAATCA": 2047,
      "TGTGGCC": 2048,
      "TCTAGTT": 2049,
      "GTTCAAA": 2050,
      "GCATTGA": 2051,
      "TATCTTC": 2052,
      "GTATAC": 2053,
      "TCAGAGA": 2054,
      "TTTTAATT": 2055,
      "CAGCTGCC": 2056,
      "GTCCATT": 2057,
      "CCTCTT": 2058,
      "TCTGTTAA": 2059,
      "TCATGTT": 2060,
      "TTACTAA": 2061,
      "GCTAAC": 2062,
      "GAGAGCAA": 2063,
      "TCAAAATT": 2064,
      "GCCAGCA": 2065,
      "TCCTCTC": 2066,
      "AAAAGAAA": 2067,
      "CACTCGG": 2068,
      "GGGGAA": 2069,
      "GCATAAA": 2070,
      "CACTGTT": 2071,
      "CAGCTTC": 2072,
      "TATTTCC": 2073,
      "GAATCTT": 2074,
      "TATCCAA": 2075,
      "CACAGGC": 2076,
      "GGAGTA": 2077,
      "CCCTTC": 2078,
      "TCTCGGC": 2079,
      "TCAATGA": 2080,
      "CACCTGA": 2081,
      "TCAAGATT": 2082,
      "TGGATTC": 2083,
      "GACTGTG": 2084,
      "GCTAGTT": 2085,
      "TGGCACC": 2086,
      "TCGTTA": 2087,
      "GCCTTTT": 2088,
      "CATGGGC": 2089,
      "GGACAC": 2090,
      "TAAGAAAA": 2091,
      "TAACCAA": 2092,
      "GTGTCTG": 2093,
      "GAAATAC": 2094,
      "TGGGAAAA": 2095,
      "CATTTCA": 2096,
      "TTTGTTTT": 2097,
      "GGCTCTT": 2098,
      "TATGGAA": 2099,
      "CATTTTAA": 2100,
      "TCGAGA": 2101,
      "GATTTCA": 2102,
      "GTGCTTTT": 2103,
      "GTGTCA": 2104,
      "CCGTT": 2105,
      "TGCCAAA": 2106,
      "TCTCTCA": 2107,
      "TACATTAA": 2108,
      "TGGAGCC": 2109,
      "CATATGA": 2110,
      "TAGGAAA": 2111,
      "AACTTA": 2112,
      "TGCTTGA": 2113,
      "TCCCTCC": 2114,
      "GGTGAA": 2115,
      "GTAGGC": 2116,
      "CAGGCTT": 2117,
      "TATATAAA": 2118,
      "TTTTTGC": 2119,
      "GCTTTCA": 2120,
      "TCTCTCTT": 2121,
      "CAGGAGAA": 2122,
      "GGCCTT": 2123,
      "TGTGTCTG": 2124,
      "TGTAGGA": 2125,
      "GCGCAC": 2126,
      "GTCTAC": 2127,
      "GCATAC": 2128,
      "TTCTCAAA": 2129,
      "TATAGTG": 2130,
      "TTAGCC": 2131,
      "TAAGCTT": 2132,
      "TTGACAA": 2133,
      "GTAACC": 2134,
      "TAGTTAA": 2135,
      "GCCACAA": 2136,
      "GAACAC": 2137,
      "GGAAGGC": 2138,
      "TGACAATT": 2139,
      "TTTTGATG": 2140,
      "TGTGCTT": 2141,
      "TCGCTA": 2142,
      "TTTGGTT": 2143,
      "TGCGGA": 2144,
      "GCTCAGG": 2145,
      "TACCAAC": 2146,
      "GTCAGGA": 2147,
      "TAGGGTT": 2148,
      "TTTTCCTT": 2149,
      "AACTCTT": 2150,
      "TGCCCAA": 2151,
      "TTACCTT": 2152,
      "CATAAAC": 2153,
      "CACAGATT": 2154,
      "TATCAAC": 2155,
      "TTCTCCAA": 2156,
      "GCCATGC": 2157,
      "GTCAGAA": 2158,
      "TAAATAC": 2159,
      "GTCATCA": 2160,
      "TATAGAA": 2161,
      "CATGTCA": 2162,
      "GTGGATT": 2163,
      "TCCCGG": 2164,
      "TTAGTTA": 2165,
      "GCACCAA": 2166,
      "TCTTGTA": 2167,
      "GTTTTGTT": 2168,
      "TGCCACC": 2169,
      "CACTTTT": 2170,
      "GCAGGAA": 2171,
      "TGGTGGTG": 2172,
      "GGCTTTT": 2173,
      "GAAAGCTT": 2174,
      "CCAAAC": 2175,
      "CAGCGG": 2176,
      "TCCGAA": 2177,
      "GCCTG": 2178,
      "TCTGGATT": 2179,
      "TCAAACTT": 2180,
      "CATGGTC": 2181,
      "CACCTTTT": 2182,
      "CAGTCCC": 2183,
      "CAGACTT": 2184,
      "CCCTGGC": 2185,
      "GATATT": 2186,
      "TCTTTTA": 2187,
      "GCCCTGC": 2188,
      "TCTTCAATT": 2189,
      "CAGAAGG": 2190,
      "CAGAACC": 2191,
      "GTGAATT": 2192,
      "TGAGACC": 2193,
      "TGCAGGC": 2194,
      "TTATGTA": 2195,
      "GTGGTGA": 2196,
      "GTCTTTA": 2197,
      "AAAGC": 2198,
      "TAATTTG": 2199,
      "GCACTAC": 2200,
      "TGGACAGTG": 2201,
      "TGGGGGC": 2202,
      "GTGAACC": 2203,
      "GTATTCC": 2204,
      "CATCTGA": 2205,
      "GCTGTCC": 2206,
      "GAGGGTG": 2207,
      "TGAGGAAA": 2208,
      "TAGTATT": 2209,
      "TGGAGGC": 2210,
      "CAGGGTC": 2211,
      "CATTTAC": 2212,
      "GAGTCC": 2213,
      "GAGGTT": 2214,
      "GGAAGGA": 2215,
      "CAGATCA": 2216,
      "GGCCCCC": 2217,
      "CAGGACC": 2218,
      "GTATCA": 2219,
      "CCTAA": 2220,
      "CAGGGC": 2221,
      "GATCTAAA": 2222,
      "TCTCTGTG": 2223,
      "TGGGTGTCC": 2224,
      "TGAACAAA": 2225,
      "TGGT": 2226,
      "GTCACAA": 2227,
      "GAATGA": 2228,
      "TACCTAC": 2229,
      "CACTCTT": 2230,
      "GAAAAAA": 2231,
      "GTCGCTT": 2232,
      "TTCTGTA": 2233,
      "GCATTAC": 2234,
      "TATCTCA": 2235,
      "TTGAGAC": 2236,
      "GGTGTT": 2237,
      "GATGAC": 2238,
      "TGGGGCC": 2239,
      "TGAAACTT": 2240,
      "CAGCAAAA": 2241,
      "GGAGGTG": 2242,
      "TCCTTTG": 2243,
      "GGGTAA": 2244,
      "TTCCAAA": 2245,
      "TTTTTAC": 2246,
      "TCATGCC": 2247,
      "GTAGTAA": 2248,
      "GAGATATG": 2249,
      "GTGCAGA": 2250,
      "TATGTGA": 2251,
      "TTCGAA": 2252,
      "TTAATAA": 2253,
      "GCTATTA": 2254,
      "GTCGTT": 2255,
      "TTCTC": 2256,
      "TTCTCCC": 2257,
      "TAGCAGG": 2258,
      "TACCAGCA": 2259,
      "TGCGGC": 2260,
      "TGGCAAC": 2261,
      "TGAAAGATGA": 2262,
      "GGAGATG": 2263,
      "TCCTCAA": 2264,
      "TGGAGTC": 2265,
      "GATCCA": 2266,
      "TTCAACAA": 2267,
      "GGCACC": 2268,
      "TGGGTTTT": 2269,
      "TACTTTG": 2270,
      "TAAGCC": 2271,
      "TTAGAGG": 2272,
      "GTTGAC": 2273,
      "GCTGGCC": 2274,
      "TGGACAC": 2275,
      "GCTTGGA": 2276,
      "CAGCACAA": 2277,
      "GCTAGG": 2278,
      "GTTCAC": 2279,
